Dlubal.SteelSurfaces.ST_THICK_TYPE
Thickness type of surface

Dlubal.SteelSurfaces.ST_THICK_TYPE.ST_THICK_CONST
Thickness constant

Dlubal.SteelSurfaces.ST_THICK_TYPE.ST_THICK_LINEAR
Thickness linear

Dlubal.SteelSurfaces.ST_THICK_TYPE.ST_THICK_COUPLING
Thickness coupling

Dlubal.SteelSurfaces.ST_THICK_TYPE.ST_THICK_RIGID
Thickness rigid

Dlubal.SteelSurfaces.ST_THICK_TYPE.ST_THICK_ORTHO
Thickness orthotrop

Dlubal.SteelSurfaces.ST_THICK_TYPE.ST_THICK_NULL
Thickness null